jmeter/01_low_baseline_mixed_0300_nochaos_tst.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="[LOW BASELINE] Mixed Workload 300 RPS - No Chaos" enabled="true">
      <stringProp name="TestPlan.comments">Low load baseline at 300 RPS (~27% of R_sat=1100). No chaos. Analyze MEASURE_LOW_0300_RPS_BASELINE_STEADY_240S.</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="GATEWAY_HOST" elementType="Argument"><stringProp name="Argument.name">GATEWAY_HOST</stringProp><stringProp name="Argument.value">172.30.35.37</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="GATEWAY_PORT" elementType="Argument"><stringProp name="Argument.name">GATEWAY_PORT</stringProp><stringProp name="Argument.value">8080</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="TARGET_PATH" elementType="Argument"><stringProp name="Argument.name">TARGET_PATH</stringProp><stringProp name="Argument.value">/api/simulate-mixed-call</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="CHAOS_TARGET_PORT" elementType="Argument"><stringProp name="Argument.name">CHAOS_TARGET_PORT</stringProp><stringProp name="Argument.value">8083</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector><hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector><hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="[Setup] Reset system state" enabled="true">
  <intProp name="ThreadGroup.num_threads">1</intProp><intProp name="ThreadGroup.ramp_time">1</intProp><boolProp name="ThreadGroup.scheduler">false</boolProp><stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
  <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController"><stringProp name="LoopController.loops">1</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp>
</SetupThreadGroup><hashTree>
  <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="[Setup] Clear runtime label properties" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="script"><![CDATA[props.remove('official.benchmark.start.ms')
props.remove('official.benchmark.current.label')]]></stringProp><stringProp name="scriptLanguage">groovy</stringProp></JSR223Sampler><hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset chaos on backend 8081" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">8081</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset chaos on backend 8082" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">8082</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset chaos on backend 8083" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">8083</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset ALB Gateway state" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/actuator/alb/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<TestAction guiclass="TestActionGui" testclass="TestAction" testname="[Setup] Wait 15000ms for Eureka/ALB/metrics to stabilize" enabled="true">
  <intProp name="ActionProcessor.action">1</intProp>
  <intProp name="ActionProcessor.target">0</intProp>
  <stringProp name="ActionProcessor.duration">15000</stringProp>
</TestAction><hashTree/>
</hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="[Main] Low Baseline - Mixed 300 RPS no chaos" enabled="true">
  <intProp name="ThreadGroup.num_threads">800</intProp>
  <intProp name="ThreadGroup.ramp_time">30</intProp>
  <longProp name="ThreadGroup.duration">390</longProp>
  <longProp name="ThreadGroup.delay">0</longProp>
  <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
  <boolProp name="ThreadGroup.scheduler">true</boolProp>
  <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
  <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController"><intProp name="LoopController.loops">-1</intProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp>
</ThreadGroup><hashTree>
  <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
    <intProp name="HTTPSampler.connect_timeout">5000</intProp><intProp name="HTTPSampler.response_timeout">30000</intProp>
    <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp><stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
  </ConfigTestElement><hashTree/>
  <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="[Label] Set benchmark phase label by elapsed time" enabled="true">
  <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp>
  <stringProp name="script"><![CDATA[long now = System.currentTimeMillis()
String startKey = 'official.benchmark.start.ms'
if (props.get(startKey) == null) {
    props.put(startKey, String.valueOf(now))
}
long startMs = Long.parseLong(String.valueOf(props.get(startKey)))
long elapsedSec = (long) ((now - startMs) / 1000L)
def windows = [
  [0L, 60L, 'DISCARD_RAMP_0000_TO_0300_RPS'],
  [60L, 300L, 'MEASURE_LOW_0300_RPS_BASELINE_STEADY_240S'],
  [300L, 330L, 'DISCARD_LOW_0300_RPS_END_GUARD_30S'],
  [330L, 360L, 'DISCARD_RAMPDOWN_0300_TO_0000_RPS'],
]
String label = 'DISCARD_OUTSIDE_DEFINED_WINDOWS'
for (def w : windows) {
    if (elapsedSec >= (long) w[0] && elapsedSec < (long) w[1]) {
        label = (String) w[2]
        break
    }
}
vars.put('BENCHMARK_LABEL', label)
props.put('official.benchmark.current.label', label)
vars.put('ELAPSED_SECONDS', String.valueOf(elapsedSec))]]></stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PreProcessor><hashTree/>
  <SwitchController guiclass="SwitchControllerGui" testclass="SwitchController" testname="Weighted mixed API profile switch | light 60%, medium 25%, slow 12%, very-slow 3%" enabled="true">
    <stringProp name="SwitchController.value">${__groovy(int r = java.util.concurrent.ThreadLocalRandom.current().nextInt(100); r &lt; 60 ? '0' : r &lt; 85 ? '1' : r &lt; 97 ? '2' : '3')}</stringProp>
  </SwitchController><hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=light" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=light</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy><hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
  <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
  <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp>
  <stringProp name="script"><![CDATA[def label = vars.get('BENCHMARK_LABEL') ?: 'DISCARD_UNKNOWN'
def path = vars.get('TARGET_PATH') ?: '/api/simulate-mixed-call'
prev.setSampleLabel(label + '__GET_' + path)]]></stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PostProcessor><hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=medium" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=medium</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy><hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
  <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
  <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp>
  <stringProp name="script"><![CDATA[def label = vars.get('BENCHMARK_LABEL') ?: 'DISCARD_UNKNOWN'
def path = vars.get('TARGET_PATH') ?: '/api/simulate-mixed-call'
prev.setSampleLabel(label + '__GET_' + path)]]></stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PostProcessor><hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=slow" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=slow</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy><hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
  <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
  <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp>
  <stringProp name="script"><![CDATA[def label = vars.get('BENCHMARK_LABEL') ?: 'DISCARD_UNKNOWN'
def path = vars.get('TARGET_PATH') ?: '/api/simulate-mixed-call'
prev.setSampleLabel(label + '__GET_' + path)]]></stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PostProcessor><hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=very-slow" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=very-slow</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy><hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
  <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
  <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp>
  <stringProp name="script"><![CDATA[def label = vars.get('BENCHMARK_LABEL') ?: 'DISCARD_UNKNOWN'
def path = vars.get('TARGET_PATH') ?: '/api/simulate-mixed-call'
prev.setSampleLabel(label + '__GET_' + path)]]></stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PostProcessor><hashTree/>
</hashTree>
  </hashTree>
  <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer | Low baseline 300 RPS" enabled="true">
  <collectionProp name="load_profile">
          <collectionProp name="step_0">
            <stringProp name="start_rps_0">0</stringProp>
            <stringProp name="end_rps_0">300</stringProp>
            <stringProp name="duration_sec_0">60</stringProp>
          </collectionProp>
          <collectionProp name="step_1">
            <stringProp name="start_rps_1">300</stringProp>
            <stringProp name="end_rps_1">300</stringProp>
            <stringProp name="duration_sec_1">270</stringProp>
          </collectionProp>
          <collectionProp name="step_2">
            <stringProp name="start_rps_2">300</stringProp>
            <stringProp name="end_rps_2">0</stringProp>
            <stringProp name="duration_sec_2">30</stringProp>
          </collectionProp>
  </collectionProp>
</kg.apc.jmeter.timers.VariableThroughputTimer><hashTree/>
</hashTree>
      
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="[Teardown] Reset all chaos and ALB state" enabled="true">
  <intProp name="ThreadGroup.num_threads">1</intProp><intProp name="ThreadGroup.ramp_time">1</intProp><boolProp name="ThreadGroup.scheduler">false</boolProp><stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
  <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController"><stringProp name="LoopController.loops">1</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp>
</PostThreadGroup><hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset chaos on backend 8081" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">8081</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset chaos on backend 8082" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">8082</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset chaos on backend 8083" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">8083</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset ALB Gateway state" enabled="true">
  <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/actuator/alb/reset</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables"><collectionProp name="Arguments.arguments"/></elementProp>
</HTTPSamplerProxy>
<hashTree>
  <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
  <collectionProp name="Asserion.test_strings"><stringProp name="95039075">2\d\d</stringProp></collectionProp>
  <intProp name="Assertion.test_type">1</intProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
</ResponseAssertion>
  <hashTree/>
</hashTree>
</hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>